load-tests/room3-soak.yml
config:
  target: "ws://127.0.0.1:8001/ws/chat/3/"
  engines:
    ws: {}
  phases:
    - duration: 60   # warm up
      arrivalRate: 5
    - duration: 300  # steady
      arrivalRate: 10
    - duration: 300  # step
      arrivalRate: 20

scenarios:
  - name: room3-rc
    engine: ws
    weight: 1
    flow:
      - connect:
          headers:
            Origin: "http://127.0.0.1:8000"
            Cookie: "sessionid=j8rnx1jsjghcwj9umta86p537kvpzfe7"
      - think: 1
      - loop:
          - send: { type: "typing", is_typing: true }
          - think: 0.5
          - send: { type: "typing", is_typing: false }
          - send: { type: "message", message: "rc ping {{ $randomNumber(1,1000) }}", message_client_id: "{{ $uuid }}" }
          - receive: {}
          - think: 0.25
        count: 400

  - name: room3-example
    engine: ws
    weight: 1
    flow:
      - connect:
          headers:
            Origin: "http://127.0.0.1:8000"
            Cookie: "sessionid=4q9qzoo5mzytotrmcbbbkyn0y7tgttdv"
      - think: 1
      - loop:
          - send: { type: "typing", is_typing: true }
          - think: 0.5
          - send: { type: "typing", is_typing: false }
          - send: { type: "message", message: "ex pong {{ $randomNumber(1,1000) }}", message_client_id: "{{ $uuid }}" }
          - receive: {}
          - think: 0.25
        count: 400